test.yml
config:
  target: "https://nurbek.codes"  
  phases:
    - duration: 60 
      arrivalRate: 20  
      # rampTo: 500 
  defaults:
    headers:
      User-Agent: "Artillery Load Test"

scenarios:
  - flow:
      - get:
          url: "/"
      - get:
          url: "/about"
      - get:
          url: "/projects"
      - get:
          url: "/blog"
      - get:
          url: "/features"
      - think: 1